# HLRandWFViewsFileType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageExportOptions..::..HLRandWFViewsFileType Property
ImageExportOptions Class See Also
---
File type for exported HLR and wireframe views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ImageFileType HLRandWFViewsFileType { get; set; }
```

Visual Basic
---
```text
Public Property HLRandWFViewsFileType As ImageFileType
	Get
	Set
```

Visual C++
---
```text
public:
property ImageFileType HLRandWFViewsFileType {
	ImageFileType get ();
	void set (ImageFileType value);
}
```

# Remarks
The default is JPEGMedium. This field is ignored if used to save an image to a project as a new view.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ImageExportOptions Class
Autodesk.Revit.DB Namespace